regtests/0099_soap4/test.out

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<awsns:Arr_Rec xmlns:awsns="http://soapaws/">
<arr soapenc:arrayType="awsns:rec[3]" xsi:type="soapenc:Array">
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
</arr>
</awsns:Arr_Rec>
</soapenv:Body>
</soapenv:Envelope>


<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<awsns:Arr_Rec2 xmlns:awsns="http://soapaws/">
<arr2 soapenc:arrayType="xsd:ur-type[4]" xsi:type="soapenc:Array">
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec2 xsi:type="rec2">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec2>
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
</arr2>
</awsns:Arr_Rec2>
</soapenv:Body>
</soapenv:Envelope>


<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<awsns:Arr_Rec3 xmlns:awsns="http://soapaws/">
<arr3 soapenc:arrayType="xsd:ur-type[4]" xsi:type="soapenc:Array">
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec xsi:type="xsd:string">value</rec>
   <rec xsi:type="rec">
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
</arr3>
</awsns:Arr_Rec3>
</soapenv:Body>
</soapenv:Envelope>
